## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
To view this run in a browser, visit:
https://app.terraform.io/app/OzOrgTest/TestOzOrg/runs/run-79XZzoFNfbRXydbx

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vnets.module.that.module.vnets.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "28.0.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = {
                  + dnsServers = [
                      + "8.8.8.8",
                    ]
                }
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "East US"
      + name                      = "TestVNet3"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks@2023-11-01"
    }

  # module.vnets.module.that.module.vnets.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm"
          + "module_version"  = "0.8.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "4bcc135f-80a8-482f-b67b-fc849aa4b7ac"
          + "tenant_id"       = "71356f31-4de2-4bc5-9778-f530a487e6dc"
        }
    }

  # module.vnets.module.that.module.vnets.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Run status: planned and saved (confirmable)
Workspace is unlocked
```
</details>